int inputMoney = 0;


for(;;){
print("돈을 넣으세요: ");
scan("%d", inputMoney);

printf("
|1| 블랙커피 (100원)
|2| 밀크커피 (150원)
|3| 고급커피 (200원)
|4| 거스름돈 계산 (~~원)
현재 잔여 금액 >> ~~%d
", inputMoney);
}


}






int _menu(string option){
if (option == "coffee" || option == "all"){
printf(
|1| 블랙커피 (100원)
|2| 밀크커피 (150원)
|3| 고급커피 (200원)
)

}
if (option == "juice" || option == "all"){
printf(
|1| 사과쥬뜨 ><(100원)
|2| 꼬치쥬뜨 데헷 (150원)
|3| 천성쥬스 (999999원)
)
}

~~~~ error return~ 필요~~ 

추가추가 필요


}

# 죄송합니다만... C언어(?)로 제작하신듯 합니다?
# python에서 문장 맨 뒤에 ';'는 사용하지 않습니다.
# 또한, for문의 문법은 아예 다릅니다.
# 변수를 미리 선언할 필요가 없습니다.
# main함수를 만들 필요가 없고, 함수의 시작은 def입니다.
# 출력은 printf()를 사용하지 않고, print()를 사용합니다.
# 문자열은 ""나 ''를 사용하여 만듭니다. 여러 줄일경우 """"""나 ''''''을 사용합니다.
# 입력은 input을 사용합니다.
# C와 문법이 유사한 점도 있으나, 완전히 다른 점도 많으니 유의해주시기 바랍니다.
# 문법자체가 맞지 않아 본 과제를 확인할 수가 없습니다.
# - 김재형
